/****************************************************************************
*   SYSTEM  :   CHaserサーバー
*----------------------------------------------------------------------------
*   NOTE    :   通信クライアント 自動くん
****************************************************************************/
#include "ComClient.h"                  // 通信クライアント 自動くん

/****************************************************************************
*   コンストラクタ
*
*   @param parent 親ウィジェット
****************************************************************************/
ComClient::ComClient(QObject *parent):
    BaseClient(parent)
{
    this->Name = "自動くん";
    this->IP   = "ローカル";
}

/****************************************************************************
*   周辺情報要求
*
*   @return true固定
****************************************************************************/
bool ComClient::WaitGetReady()
{
    return true;
}

/****************************************************************************
*   周辺情報応答
*
*   @return 行動情報
*
*   @param data 周辺情報
****************************************************************************/
GameSystem::Method ComClient::WaitReturnMethod([[maybe_unused]] GameSystem::AroundData data)
{
    // 戻り値[チーム:不明、行動:検索、方向:上]
    return GameSystem::Method{GameSystem::TEAM::UNKNOWN, GameSystem::Method::ACTION::SEARCH,GameSystem::Method::ROTE::UP};
}

/****************************************************************************
*   行動に対する周辺情報送信及び受信完了待機
*
*   @return true固定
****************************************************************************/
bool ComClient::WaitEndSharp([[maybe_unused]] GameSystem::AroundData data)
{
    return true;
}

/****************************************************************************
*   シグナル･スロット設定直後処理
****************************************************************************/
void ComClient::Startup()
{
    emit Connected();                   // 接続(IP表示)
    emit WriteTeamName();               // チーム名(チーム名表示)
    emit Ready();                       // 準備完了シグナル(準備完了)
}

/****************************************************************************
*   デストラクタ
****************************************************************************/
ComClient::~ComClient()
{

}
